# config.py
CHAPTER_MAP = {
    1: "【速読英単語】第1章：人間と動物の違い",
    17: "【速読英単語】第2章：蝶が違いを見分ける方法⑴",
    46: "【速読英単語】第3章：蝶が違いを見分ける方法⑵",
    67: "【速読英単語】第4章：「原始的な」言語⑴",
    87: "【速読英単語】第5章：「原始的な」言語⑵",
    119: "【速読英単語】第6章：発音と食事の関係⑴",
    138: "【速読英単語】第7章：発音と食事の関係⑵",
    174: "【速読英単語】第8章：怒りのメカニズム",
    215: "【速読英単語】第9章：ユーモアの種類と効能⑴",
    245: "【速読英単語】第10章：ユーモアの種類と効能⑵",
    272: "【速読英単語】第11章：孤立感⑴",
    303: "【速読英単語】第12章：孤立感⑵",
    341: "【速読英単語】第13章：暴力はなぜ起きる",
    369: "【速読英単語】第14章：謙虚さが教えてくれること⑴",
    403: "【速読英単語】第15章：謙虚さが教えてくれること⑵",
    424: "【速読英単語】第16章：謙虚さが教えてくれること⑶",
    441: "【速読英単語】第17章：人種差別を排除するには⑴",
    473: "【速読英単語】第18章：人種差別を排除するには⑵",
    502: "【速読英単語】第19章：受刑者に対する実験の是非⑴",
    523: "【速読英単語】第20章：受刑者に対する実験の是非⑵",
    558: "【速読英単語】第21章：ホーソン効果",
    579: "【速読英単語】第22章：ジャンクフードから見る経済格差⑴",
    594: "【速読英単語】第23章：ジャンクフードから見る経済格差⑵",
    617: "【速読英単語】第24章：ジャンクフードから見る経済格差⑶",
    629: "【速読英単語】第25章：ジャンクフードから見る経済格差⑷",
    646: "【速読英単語】第26章：適切な塩の摂取量とは⑴",
    671: "【速読英単語】第27章：適切な塩の摂取量とは⑵",
    700: "【速読英単語】第28章：健康によい運動量の本当の目安⑴",
    732: "【速読英単語】第29章：健康によい運動量の本当の目安⑵",
    743: "【速読英単語】第30章：健康によい運動量の本当の目安⑶",
    763: "【速読英単語】第31章：プラスチックが健康に与える影響⑴",
    790: "【速読英単語】第32章：プラスチックが健康に与える影響⑵",
    826: "【速読英単語】第33章：プラスチックが健康に与える影響⑶",
    1801: "【FINAL DRAFT】LESSON 1〜10",
    2001: "【Change the World】UNIT 1〜5",
    2140: "【Change the World】UNIT 6〜10",
    2314: "【Change the World】UNIT 11〜15",
    2476: "【Change the World】UNIT 16〜20",
    3974: "【東進上級英単語1000】ステージ1",
    4074: "【東進上級英単語1000】ステージ2",
    4174: "【東進上級英単語1000】ステージ3",
    4274: "【東進上級英単語1000】ステージ4",
    4374: "【東進上級英単語1000】ステージ5",
    4474: "【東進上級英単語1000】ステージ6",
    4574: "【東進上級英単語1000】ステージ7",
    4674: "【東進上級英単語1000】ステージ8",
    4774: "【東進上級英単語1000】ステージ9",
    4874: "【東進上級英単語1000】ステージ10",
    5001: "【鉄壁】#1\t重要な・ささいな",
    5026: "【鉄壁】#2\t特徴・明確さ・点",
    5048: "【鉄壁】#3\t構造・構成",
    5087: "【鉄壁】#4\t動詞をイメージする・1",
    5133: "【鉄壁】#5\t制約・強制・禁止",
    5160: "【鉄壁】#6\t阻害・除去・供給・促進",
    5192: "【鉄壁】#7\t目的・実行・達成",
    5248: "【鉄壁】#8\t時間",
    5295: "【鉄壁】#9\t金・経済",
    5333: "【鉄壁】#10\t場所・領域・範囲",
    5380: "【鉄壁】#11\t発生・繁栄・衰退・消滅",
    5410: "【鉄壁】#12\t多義語・1",
    5436: "【鉄壁】#13\t基本単語の確認",
    5492: "【鉄壁】#14\t関係・対立・一致",
    5521: "【鉄壁】#15\t言語・文学",
    5575: "【鉄壁】#16\t調査・研究",
    5605: "【鉄壁】#17\t議論・主張・要求",
    5639: "【鉄壁】#18\t語源から覚える",
    5675: "【鉄壁】#19\t力関係",
    5718: "【鉄壁】#20\t知覚・感覚・感情",
    5771: "【鉄壁】#21\t善悪・犯罪",
    5810: "【鉄壁】#22\t数・量",
    5862: "【鉄壁】#23\t思考・認識・知",
    5906: "【鉄壁】#24\t人・人生",
    5952: "【鉄壁】#25\t人間関係",
    6000: "【鉄壁】#26\t価値・基準・選択・出来事・参加",
    6042: "【鉄壁】#27\t政治",
    6086: "【鉄壁】#28\t産業",
    6139: "【鉄壁】#29\t医学・化学",
    6192: "【鉄壁】#30\t宗教・民族・慣習",
    6238: "【鉄壁】#31\t自然・環境",
    6282: "【鉄壁】#32\t短い単語",
    6347: "【鉄壁】#33\t傾向・可能性・反応",
    6383: "【鉄壁】#34\t衣食住・日常",
    6422: "【鉄壁】#35\t程度・割合",
    6471: "【鉄壁】#36\t動詞をイメージする・2",
    6511: "【鉄壁】#37\t基本動詞を用いた熟語表現・1",
    6556: "【鉄壁】#38\t熟語表現・2",
    6603: "【鉄壁】#39\t熟語表現・3",
    6653: "【鉄壁】#40\t心・身体",
    6722: "【鉄壁】#41\tコロケーションで覚える形容詞",
    6780: "【鉄壁】#42\tカタカナ英語",
    6852: "【鉄壁】#43\t教育・テクノロジー",
    6900: "【鉄壁】#44\t多義語・2",
    6934: "【鉄壁】#45\t歴史・軍事",
    6973: "【鉄壁】#46\t接続詞・副詞・前置詞",
    7008: "【鉄壁】#47\t難単語・1",
    7048: "【鉄壁】#48\t難単語・2",
    7085: "【鉄壁】#49\t難単語・3",
    7129: "【鉄壁】#50\t難単語・4",
    7177: "【Cutting Edge Orange】chapter1",
    10001: "【LEAP】1〜100",
    10101: "【LEAP】101〜200",
    10201: "【LEAP】201〜300",
    10301: "【LEAP】301〜400",
    10401: "【LEAP】401〜500",
    10501: "【LEAP】501〜600",
    10601: "【LEAP】601〜700",
    10701: "【LEAP】701〜800",
    10801: "【LEAP】801〜900",
    10901: "【LEAP】901〜1000",
    11001: "【LEAP】1001〜1100",
    11101: "【LEAP】1101〜1200",
    11201: "【LEAP】1201〜1300",
    11301: "【LEAP】1301〜1400",
    11401: "【LEAP】1401〜1500",
    11501: "【LEAP】1501〜1600",
    11601: "【LEAP】1601〜1700",
    11701: "【LEAP】1701〜1800",
    11801: "【LEAP】1801〜1900",
    11901: "【LEAP】1901〜1935"
}

CHAPTER_WORD_COUNT = {
    1: 33,  # 【速読英単語】第1章：人間と動物の違い
    17: 55,  # 【速読英単語】第2章：蝶が違いを見分ける方法⑴
    46: 30,  # 【速読英単語】第3章：蝶が違いを見分ける方法⑵
    67: 41,  # 【速読英単語】第4章：「原始的な」言語⑴
    87: 52,  # 【速読英単語】第5章：「原始的な」言語⑵
    119: 0,  # 【速読英単語】第6章：発音と食事の関係⑴
    138: 0,  # 【速読英単語】第7章：発音と食事の関係⑵
    174: 85,  # 【速読英単語】第8章：怒りのメカニズム
    215: 65,  # 【速読英単語】第9章：ユーモアの種類と効能⑴
    245: 51,  # 【速読英単語】第10章：ユーモアの種類と効能⑵
    272: 68,  # 【速読英単語】第11章：孤立感⑴
    303: 79,  # 【速読英単語】第12章：孤立感⑵
    341: 46,  # 【速読英単語】第13章：暴力はなぜ起きる
    369: 56,  # 【速読英単語】第14章：謙虚さが教えてくれること⑴
    403: 42,  # 【速読英単語】第15章：謙虚さが教えてくれること⑵
    424: 32,  # 【速読英単語】第16章：謙虚さが教えてくれること⑶
    441: 79,  # 【速読英単語】第17章：人種差別を排除するには⑴
    473: 57,  # 【速読英単語】第18章：人種差別を排除するには⑵
    502: 45,  # 【速読英単語】第19章：受刑者に対する実験の是非⑴
    523: 63,  # 【速読英単語】第20章：受刑者に対する実験の是非⑵
    558: 36,  # 【速読英単語】第21章：ホーソン効果
    579: 24,  # 【速読英単語】第22章：ジャンクフードから見る経済格差⑴
    594: 31,  # 【速読英単語】第23章：ジャンクフードから見る経済格差⑵
    617: 17,  # 【速読英単語】第24章：ジャンクフードから見る経済格差⑶
    629: 21,  # 【速読英単語】第25章：ジャンクフードから見る経済格差⑷
    646: 40,  # 【速読英単語】第26章：適切な塩の摂取量とは⑴
    671: 52,  # 【速読英単語】第27章：適切な塩の摂取量とは⑵
    700: 44,  # 【速読英単語】第28章：健康によい運動量の本当の目安⑴
    732: 42,  # 【速読英単語】第29章：健康によい運動量の本当の目安⑵
    743: 41,  # 【速読英単語】第30章：健康によい運動量の本当の目安⑶
    763: 27,  # 【速読英単語】第31章：プラスチックが健康に与える影響⑴
    790: 0,  # 【速読英単語】第32章：プラスチックが健康に与える影響⑵
    826: 0,  # 【速読英単語】第33章：プラスチックが健康に与える影響⑶
    1801: 0,  # 【FINAL DRAFT】LESSON 1〜10
    2001: 139,  # 【Change the World】UNIT 1〜5
    2140: 174,  # 【Change the World】UNIT 6〜10
    2314: 162,  # 【Change the World】UNIT 11〜15
    2476: 171,  # 【Change the World】UNIT 16〜20
    3974: 15,  # 【東進上級英単語1000】ステージ1
    4074: 24,  # 【東進上級英単語1000】ステージ2
    4174: 19,  # 【東進上級英単語1000】ステージ3
    4274: 38,  # 【東進上級英単語1000】ステージ4
    4374: 34,  # 【東進上級英単語1000】ステージ5
    4474: 36,  # 【東進上級英単語1000】ステージ6
    4574: 45,  # 【東進上級英単語1000】ステージ7
    4674: 52,  # 【東進上級英単語1000】ステージ8
    4774: 50,  # 【東進上級英単語1000】ステージ9
    4874: 52,  # 【東進上級英単語1000】ステージ10
    5001: 25,  # 【鉄壁】#1	重要な・ささいな
    5026: 22,  # 【鉄壁】#2	特徴・明確さ・点
    5048: 39,  # 【鉄壁】#3	構造・構成
    5087: 46,  # 【鉄壁】#4	動詞をイメージする・1
    5133: 27,  # 【鉄壁】#5	制約・強制・禁止
    5160: 32,  # 【鉄壁】#6	阻害・除去・供給・促進
    5192: 56,  # 【鉄壁】#7	目的・実行・達成
    5248: 47,  # 【鉄壁】#8	時間
    5295: 38,  # 【鉄壁】#9	金・経済
    5333: 47,  # 【鉄壁】#10	場所・領域・範囲
    5380: 30,  # 【鉄壁】#11	発生・繁栄・衰退・消滅
    5410: 26,  # 【鉄壁】#12	多義語・1
    5436: 56,  # 【鉄壁】#13	基本単語の確認
    5492: 29,  # 【鉄壁】#14	関係・対立・一致
    5521: 54,  # 【鉄壁】#15	言語・文学
    5575: 30,  # 【鉄壁】#16	調査・研究
    5605: 34,  # 【鉄壁】#17	議論・主張・要求
    5639: 36,  # 【鉄壁】#18	語源から覚える
    5675: 43,  # 【鉄壁】#19	力関係
    5718: 53,  # 【鉄壁】#20	知覚・感覚・感情
    5771: 39,  # 【鉄壁】#21	善悪・犯罪
    5810: 52,  # 【鉄壁】#22	数・量
    5862: 44,  # 【鉄壁】#23	思考・認識・知
    5906: 46,  # 【鉄壁】#24	人・人生
    5952: 48,  # 【鉄壁】#25	人間関係
    6000: 42,  # 【鉄壁】#26	価値・基準・選択・出来事・参加
    6042: 44,  # 【鉄壁】#27	政治
    6086: 53,  # 【鉄壁】#28	産業
    6139: 53,  # 【鉄壁】#29	医学・化学
    6192: 46,  # 【鉄壁】#30	宗教・民族・慣習
    6238: 44,  # 【鉄壁】#31	自然・環境
    6282: 65,  # 【鉄壁】#32	短い単語
    6347: 36,  # 【鉄壁】#33	傾向・可能性・反応
    6383: 39,  # 【鉄壁】#34	衣食住・日常
    6422: 49,  # 【鉄壁】#35	程度・割合
    6471: 40,  # 【鉄壁】#36	動詞をイメージする・2
    6511: 45,  # 【鉄壁】#37	基本動詞を用いた熟語表現・1
    6556: 47,  # 【鉄壁】#38	熟語表現・2
    6603: 50,  # 【鉄壁】#39	熟語表現・3
    6653: 69,  # 【鉄壁】#40	心・身体
    6722: 58,  # 【鉄壁】#41	コロケーションで覚える形容詞
    6780: 72,  # 【鉄壁】#42	カタカナ英語
    6852: 48,  # 【鉄壁】#43	教育・テクノロジー
    6900: 34,  # 【鉄壁】#44	多義語・2
    6934: 39,  # 【鉄壁】#45	歴史・軍事
    6973: 35,  # 【鉄壁】#46	接続詞・副詞・前置詞
    7008: 40,  # 【鉄壁】#47	難単語・1
    7048: 37,  # 【鉄壁】#48	難単語・2
    7085: 44,  # 【鉄壁】#49	難単語・3
    7129: 48,  # 【鉄壁】#50	難単語・4
    7177: 0,
    10001: 0,  # 【LEAP】1〜100
    10101: 0,  # 【LEAP】101〜200
    10201: 0,  # 【LEAP】201〜300
    10301: 0,  # 【LEAP】301〜400
    10401: 0,  # 【LEAP】401〜500
    10501: 0,  # 【LEAP】501〜600
    10601: 0,  # 【LEAP】601〜700
    10701: 0,  # 【LEAP】701〜800
    10801: 0,  # 【LEAP】801〜900
    10901: 0,  # 【LEAP】901〜1000
    11001: 100,  # 【LEAP】1001〜1100
    11101: 100,  # 【LEAP】1101〜1200
    11201: 100,  # 【LEAP】1201〜1300
    11301: 100,  # 【LEAP】1301〜1400
    11401: 100,  # 【LEAP】1401〜1500
    11501: 100,  # 【LEAP】1501〜1600
    11601: 100,  # 【LEAP】1601〜1700
    11701: 100,  # 【LEAP】1701〜1800
    11801: 100,  # 【LEAP】1801〜1900
    11901: 35,  # 【LEAP】1901〜1935
}
