# config.py
CHAPTER_MAP = {
    1: "【速読英単語】第1章：人間と動物の違い",
    17: "【速読英単語】第2章：蝶が違いを見分ける方法⑴",
    46: "【速読英単語】第3章：蝶が違いを見分ける方法⑵",
    67: "【速読英単語】第4章：「原始的な」言語⑴",
    87: "【速読英単語】第5章：「原始的な」言語⑵",
    119: "【速読英単語】第6章：発音と食事の関係⑴",
    138: "【速読英単語】第7章：発音と食事の関係⑵",
    174: "【速読英単語】第8章：怒りのメカニズム",
    215: "【速読英単語】第9章：ユーモアの種類と効能⑴",
    245: "【速読英単語】第10章：ユーモアの種類と効能⑵",
    272: "【速読英単語】第11章：孤立感⑴",
    303: "【速読英単語】第12章：孤立感⑵",
    341: "【速読英単語】第13章：暴力はなぜ起きる",
    369: "【速読英単語】第14章：謙虚さが教えてくれること⑴",
    403: "【速読英単語】第15章：謙虚さが教えてくれること⑵",
    424: "【速読英単語】第16章：謙虚さが教えてくれること⑶",
    441: "【速読英単語】第17章：人種差別を排除するには⑴",
    473: "【速読英単語】第18章：人種差別を排除するには⑵",
    502: "【速読英単語】第19章：受刑者に対する実験の是非⑴",
    523: "【速読英単語】第20章：受刑者に対する実験の是非⑵",
    558: "【速読英単語】第21章：ホーソン効果",
    579: "【速読英単語】第22章：ジャンクフードから見る経済格差⑴",
    594: "【速読英単語】第23章：ジャンクフードから見る経済格差⑵",
    617: "【速読英単語】第24章：ジャンクフードから見る経済格差⑶",
    629: "【速読英単語】第25章：ジャンクフードから見る経済格差⑷",
    646: "【速読英単語】第26章：適切な塩の摂取量とは⑴",
    671: "【速読英単語】第27章：適切な塩の摂取量とは⑵",
    700: "【速読英単語】第28章：健康によい運動量の本当の目安⑴",
    732: "【速読英単語】第29章：健康によい運動量の本当の目安⑵",
    743: "【速読英単語】第30章：健康によい運動量の本当の目安⑶",
    763: "【速読英単語】第31章：プラスチックが健康に与える影響⑴",
    790: "【速読英単語】第32章：プラスチックが健康に与える影響⑵",
    826: "【速読英単語】第33章：プラスチックが健康に与える影響⑶",
    1801: "【FINAL DRAFT】LESSON1〜10",
    3974: "【東進上級英単語1000】ステージ1",
    4074: "【東進上級英単語1000】ステージ2",
    4174: "【東進上級英単語1000】ステージ3",
    4274: "【東進上級英単語1000】ステージ4",
    4374: "【東進上級英単語1000】ステージ5",
    4474: "【東進上級英単語1000】ステージ6",
    4574: "【東進上級英単語1000】ステージ7",
    4674: "【東進上級英単語1000】ステージ8",
    4774: "【東進上級英単語1000】ステージ9",
    4874: "【東進上級英単語1000】ステージ10",
    10001: "【LEAP】1〜100",
    10101: "【LEAP】101〜200",
    10201: "【LEAP】201〜300",
    10301: "【LEAP】301〜400",
    10401: "【LEAP】401〜500",
    10501: "【LEAP】501〜600",
    10601: "【LEAP】601〜700",
    10701: "【LEAP】701〜800",
    10801: "【LEAP】801〜900",
    10901: "【LEAP】901〜1000",
    11001: "【LEAP】1001〜1100",
    11101: "【LEAP】1101〜1200",
    11201: "【LEAP】1201〜1300",
    11301: "【LEAP】1301〜1400",
    11401: "【LEAP】1401〜1500",
    11501: "【LEAP】1501〜1600",
    11601: "【LEAP】1601〜1700",
    11701: "【LEAP】1701〜1800",
    11801: "【LEAP】1801〜1900",
    11901: "【LEAP】1901〜1935"
}

CHAPTER_WORD_COUNT = {
    1: 33,  # 【速読英単語】第1章：人間と動物の違い
    17: 55,  # 【速読英単語】第2章：蝶が違いを見分ける方法⑴
    46: 30,  # 【速読英単語】第3章：蝶が違いを見分ける方法⑵
    67: 41,  # 【速読英単語】第4章：「原始的な」言語⑴
    87: 52,  # 【速読英単語】第5章：「原始的な」言語⑵
    119: 0,  # 【速読英単語】第6章：発音と食事の関係⑴
    138: 0,  # 【速読英単語】第7章：発音と食事の関係⑵
    174: 85,  # 【速読英単語】第8章：怒りのメカニズム
    215: 65,  # 【速読英単語】第9章：ユーモアの種類と効能⑴
    245: 51,  # 【速読英単語】第10章：ユーモアの種類と効能⑵
    272: 68,  # 【速読英単語】第11章：孤立感⑴
    303: 79,  # 【速読英単語】第12章：孤立感⑵
    341: 46,  # 【速読英単語】第13章：暴力はなぜ起きる
    369: 56,  # 【速読英単語】第14章：謙虚さが教えてくれること⑴
    403: 42,  # 【速読英単語】第15章：謙虚さが教えてくれること⑵
    424: 32,  # 【速読英単語】第16章：謙虚さが教えてくれること⑶
    441: 79,  # 【速読英単語】第17章：人種差別を排除するには⑴
    473: 57,  # 【速読英単語】第18章：人種差別を排除するには⑵
    502: 45,  # 【速読英単語】第19章：受刑者に対する実験の是非⑴
    523: 63,  # 【速読英単語】第20章：受刑者に対する実験の是非⑵
    558: 36,  # 【速読英単語】第21章：ホーソン効果
    579: 24,  # 【速読英単語】第22章：ジャンクフードから見る経済格差⑴
    594: 31,  # 【速読英単語】第23章：ジャンクフードから見る経済格差⑵
    617: 17,  # 【速読英単語】第24章：ジャンクフードから見る経済格差⑶
    629: 21,  # 【速読英単語】第25章：ジャンクフードから見る経済格差⑷
    646: 40,  # 【速読英単語】第26章：適切な塩の摂取量とは⑴
    671: 52,  # 【速読英単語】第27章：適切な塩の摂取量とは⑵
    700: 44,  # 【速読英単語】第28章：健康によい運動量の本当の目安⑴
    732: 42,  # 【速読英単語】第29章：健康によい運動量の本当の目安⑵
    743: 41,  # 【速読英単語】第30章：健康によい運動量の本当の目安⑶
    763: 27,  # 【速読英単語】第31章：プラスチックが健康に与える影響⑴
    790: 0,  # 【速読英単語】第32章：プラスチックが健康に与える影響⑵
    826: 0,  # 【速読英単語】第33章：プラスチックが健康に与える影響⑶
    3974: 15,  # 【東進上級英単語1000】ステージ1
    4074: 24,  # 【東進上級英単語1000】ステージ2
    4174: 19,  # 【東進上級英単語1000】ステージ3
    4274: 38,  # 【東進上級英単語1000】ステージ4
    4374: 34,  # 【東進上級英単語1000】ステージ5
    4474: 36,  # 【東進上級英単語1000】ステージ6
    4574: 45,  # 【東進上級英単語1000】ステージ7
    4674: 52,  # 【東進上級英単語1000】ステージ8
    4774: 50,  # 【東進上級英単語1000】ステージ9
    4874: 52,  # 【東進上級英単語1000】ステージ10
    10001: 0,  # 【LEAP】1〜100
    10101: 0,  # 【LEAP】101〜200
    10201: 0,  # 【LEAP】201〜300
    10301: 0,  # 【LEAP】301〜400
    10401: 0,  # 【LEAP】401〜500
    10501: 0,  # 【LEAP】501〜600
    10601: 0,  # 【LEAP】601〜700
    10701: 0,  # 【LEAP】701〜800
    10801: 0,  # 【LEAP】801〜900
    10901: 0,  # 【LEAP】901〜1000
    11001: 100,  # 【LEAP】1001〜1100
    11101: 100,  # 【LEAP】1101〜1200
    11201: 100,  # 【LEAP】1201〜1300
    11301: 100,  # 【LEAP】1301〜1400
    11401: 100,  # 【LEAP】1401〜1500
    11501: 100,  # 【LEAP】1501〜1600
    11601: 100,  # 【LEAP】1601〜1700
    11701: 100,  # 【LEAP】1701〜1800
    11801: 100,  # 【LEAP】1801〜1900
    11901: 35,  # 【LEAP】1901〜1935
}
